## Apa itu Categorial Encoding?

#### Categorial Encoding adalah proses konversi nilai categorial menjadi numerical

#### Terdapat banyak jenis Categorial Encoding, dua di antaranya adalah:
- Label Encoding
- One Hot Encoding

## Label Encoding

#### Pada Label Encoding, setiap kategori pada suatu feature akan diurutkan secara alfabelt dan direpresentasikan dengan sebuah nilai integer

### DataSet

In [2]:
import pandas as pd

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

## Label Encoding pada scikit learn

In [3]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [4]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

#### array yang di hitung pakai index jadi india 0 japan 1 US 2

## One Hot Encoding

#### Pada One Hot Encoding setiap kategori pada suatu feature akan diurutkan secara alfabet dan direpresentasikan sebagai sekumpulan bits.

### DataSet

In [2]:
import pandas as pd

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

## One Hot Encoding pada scikit learn

In [7]:
X = df['country'].values.reshape(-1, 1)
X
# reshape di gunakan untuk menjadikan features di scikit learn, array 2 dimensi

array([['India'],
       ['US'],
       ['Japan'],
       ['US'],
       ['Japan']], dtype=object)

In [8]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [9]:
onehot_encoder.categories_

# hitugnnay kaya biasa 1 2 3
# baris pertama itu india
# bartis kedua dan 4 US
# baris ketiga dan kelima itu japan

[array(['India', 'Japan', 'US'], dtype=object)]

#### hasil Encodingnya di konversikan DataFrame

In [10]:
df_onehot = pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [11]:
# gabungin data frame baru dengan df lama
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2 country  age  salary
0  1.0  0.0  0.0   India   44   72000
1  0.0  0.0  1.0      US   34   65000
2  0.0  1.0  0.0   Japan   46   98000
3  0.0  0.0  1.0      US   35   45000
4  0.0  1.0  0.0   Japan   23   34000

In [12]:
df = df.drop(['country'], axis=1)
df

     0    1    2  age  salary
0  1.0  0.0  0.0   44   72000
1  0.0  0.0  1.0   34   65000
2  0.0  1.0  0.0   46   98000
3  0.0  0.0  1.0   35   45000
4  0.0  1.0  0.0   23   34000

# Label Encoding vs One Hot Encoding
## Kita menerapkan One Hot Encoding bila:
- Nilai categorical adalah nominal
- jumlah kategori yang ada tidak terlalu banyak
## Kita Menerapkan Label Encoding bila:
- Nilai categorial adalah ordinal
- jumlah kategori yang ada relatif banyak